Autodesk.Revit.DB.SpatialElementTag.Name
The name associated with the tag.
Remarks: This overrides Element.Name to allow the API to prevent modifications to the tag's name
(because this is not permitted
to be modified in the Autodesk Revit UI).
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when attempting to set
this property, as the name of the tag may not be changed.

Autodesk.Revit.DB.SpatialElementTag.HasLeader
Identifies if a leader is displayed for the tag.
True if a leader is displayed, otherwise false.